[
    {
        "concept": "Adaline",
        "definition": "Red neuronal de una sola capa con múltiples nodos donde cada nodo acepta múltiples entradas y genera una salida."
    },
    {
        "concept": "ADAS",
        "definition": "Conjunto de sistemas electrónicos diseñados para ayudar a conductores en la conducción, generalmente resultando en aumento de la seguridad."
    },
    {
        "concept": "Algoritmo",
        "definition": "Conjunto ordenado y finito de operaciones que permite hallar la solución de un problema."
    },
    {
        "concept": "Algoritmo Genético",
        "definition": "Método adaptativo que puede usarse para resolver problemas de búsqueda y optimización. Están basados en el proceso genético de los organismos vivos. Estos métodos son capaces de ir creando soluciones para problemas del mundo real. La evolucion de dichas soluciones hacia valores óptimos del problema depende en buena medida de una adecuada codificación de las mismas."
    },
    {
        "concept": "Aprendizaje no supervisado",
        "definition": "Tipo de algoritmo de aprendizaje que infieren patrones de un conjunto de datos sin referencia a resultados conocidos o etiquetados."
    },
    {
        "concept": "Aprendizaje por refuerzo",
        "definition": "Es el área de la inteligencia artificial que está centrada en descubrir qué acciones se deben tomar para maximizar la señal de recomensa. En otras palabras, se centra en cómo mapear situaciones a acciones que se centren en encontrar dicha recompensa."
    },
    {
        "concept": "Aprendizaje supervisado",
        "definition": "Tipo de algoritmo de aprendizaje que infieren patrones de un conjunto de datos etiquetados."
    },
    {
        "concept": "Árbol de decisión",
        "definition": "Tipo de modelo de aprendizaje supervisado utilizado para clasificación y regresión. Está compuesto por nodos (hojas), que representan los valores/clases y conexiones (ramas), que representan los resultados de las acciones. Este modelo puede ser una representación visual de las consecuencias de las diferentes acciones. ID3 o M5 son ejemplos de este tipo de modelo."
    },
    {
        "concept": "Backpropagation",
        "definition": "Algoritmo de aprendizaje supervisado utilizado para entrenar redes de neuronas. Se comienza en la capa de salida y se arrastran los errores entre las salidas reales y las deseadas, utilizándolos para corregir los pesos de las conexiones de la capa anterior."
    },
    {
        "concept": "Bag-of-words",
        "definition": "Colección simplificada o reducida de palabras que son extraídas de un documento sin considerar la gramática o el orden en que estas van apareciendo. Útil para tareas como la detección de spam en el correo electrónico."
    },
    {
        "concept": "Balanceo",
        "definition":"Práctica de ajustar o igualar la distribución de datos de entrada o clases en un conjunto de datos, con el fin de evitar sesgos y mejorar el rendimiento de los modelos de aprendizaje automático."
    },
    {
        "concept": "Base de conocimiento",
        "definition": "Se trata de una colección de hechos, reglas y procedimientos esquematizados. Contiene toda la información y conocimiento sobre un campo específico."
    },
    {
        "concept": "Big data",
        "definition": "Conjunto de datos extremadamente grande y complejo que requiere técnicas de procesamiento y análisis avanzadas, a menudo utilizando herramientas de inteligencia artificial, para extraer información y conocimientos significativos."
    },
    {
        "concept": "Bioseñal",
        "definition": "Señal eléctrica, química u otro tipo de señal física que se origina en un organismo vivo y puede ser utilizada para monitorizar o estudiar procesos biológicos o fisiológicos." 
    },
    {
        "concept": "Capa Oculta",
        "definition": "Relativa a una red neuronal artificial. Es una capa situada entre las capas de entrada y de salida que sirve de comunicación entre ambas. Se encarga de realizar el procesamiento de la información, tomando un conjunto de entradas ponderadas y produciendo una salida a través de una función de activación. Esto es, realizan el procesamiento no lineal de los patrones recibidos. "
    },
    {
        "concept": "Clasificación",
        "definition": "Es una tarea de minería de datos muy común, que consiste en analizar los datos históricos y crear o construir un modelo que pueda predecir la clase de una nueva instancia."
    },
    {
        "concept": "ClickStream Analysis",
        "definition": "El análisis de la secuencia de clicks (recorrido) que realiza un determinado usuario en la web."
    },
    {
        "concept": "Clustering",
        "definition": "Consiste en encontrar el agrupamiento natural de los ejemplos no etiquetados, de esta manera se crean clústeres o grupos a partir de los atributos de los datos. Cuando se reciba una instancia por proximidad a los clústeres se determina cuál pertenece."
    },
    {
        "concept": "Computación Afectiva",
        "definition": "Estudio y desarrollo de sistemas y dispositivos que pueden reconocer, interpretar, procesar y estimular las emociones humanas. Es un campo interdisciplinario que abarca la ciencia, la psicología y la ciencia cognitiva de la computación."
    },
    {
        "concept": "Computación evolutiva",
        "definition": "Es una rama de la Inteligencia Artificial que se basa en la teoría de síntesis evolutiva moderna. Integra tres conceptos básicos de la evolución biológica: la selección, la herencia y la variación. Estos tres conceptos dan lugar a un algoritmo que realiza un proceso de búsqueda."
    },
    {
        "concept": "Corpus",
        "definition": "Es un conjunto lo mas extenso y ordenado de datos o textos científicos, literarios, etc., que se usan como fuente de datos para análisis o como base de una investigación. Un corpus puede ser una colección de documentos de texto, transcripciones de conversaciones, artículos de noticias, libros, sitios web o cualquier otra fuente de datos que contenga texto."
    },
    {
        "concept": "Cromosoma",
        "definition": "Conjunto de los valores de los parámetros que intentan dar solución al problema a resolver, cuyo diseño es específico de cada problema. Los valores de los parámetros que definen al individuo o solución se pueden representar de diversas formas."
    },
    {
        "concept": "Dashboard",
        "definition": "Presentación visual de datos críticos para que los ejecutivos los vean. Permite a los ejecutivos ver los puntos más relevantes y explorar la situación."
    },
    {
        "concept": "Data Fishing",
        "definition": "Práctica de minería de datos creada en el año 1960 que consiste en la aplicación a ciegas de métodos de minería de datos que pueden conducir al descubrimiento de patrones no válidos y sin sentido."
    },
    {
        "concept": "Dato",
        "definition": "Información sobre algo concreto que permite su conocimiento exacto o sirve para deducir las consecuencias derivadas de un hecho"
    },
    {
        "concept": "Deep blue",
        "definition": "Ordenador desarrollado por IBM que fue el primero en ganar a un campeón mundial de ajedrez en una partida oficial."
    },
    {
        "concept": "Dominio",
        "definition": "Área de conocimiento en el que se especializa un sistema experto. También, ámbito o contexto específico en el que una solución de IA está diseñada para funcionar o resolver problemas."
    },
    {
        "concept": "E-commerce",
        "definition": "Modelo de negocio que consiste en la compra y venta de productos o servicios a través de internet."
    },
    {
        "concept": "Electrocardiograma",
        "definition": "Registro gráfico de la actividad eléctrica del corazón. Se utiliza para detectar y diagnosticar enfermedades del corazón."
    },
    {
        "concept": "Electroencefalografía",
        "definition": "Técnica de registro de la actividad eléctrica del cerebro que se utiliza para medir y analizar las señales eléctricas generadas por las neuronas en el cerebro."
    },
    {
        "concept": "Elitismo",
        "definition": "En el contexto de Algoritmos Genéticos, consiste en forzar la selección de las mejores soluciones para evolucionar a través de las generaciones."
    },
    {
        "concept": "Entropía",
        "definition": "Métrica que mide el grado de incertidumbre o aleatoriedad en un conjunto de datos. Si todos los datos de un subconjunto pertenecen a la misma clase, entonces no hay incertidumbre o aleatoriedad en ese conjunto de datos, y por lo tanto el valor de esta métrica es cero."
    },
    {
        "concept": "Epoch",
        "definition": "En el contexto de las redes neuronales, se trata de una iteración completa sobre el conjunto de datos de entrenamiento. En cada epoch, el algoritmo de aprendizaje intenta ajustar los pesos de las conexiones para reducir el error de predicción. En general, se refiere a una iteración completa a través de todo el conjunto de datos de entrenamiento durante el proceso de ajuste de los parámetros del modelo."
    },
    {
        "concept": "Estocástico",
        "definition": "Relativo a procesos o sistemas que involucran elementos aleatorios o probabilísticos en su comportamiento."
    },
    {
        "concept": "Evolución",
        "definition": "Serie de transformaciones continuas que va experimentando la naturaleza y los seres que la componen."
    },
    {
        "concept": "Experto",
        "definition": "Persona con alto nivel de habilidades que la capacitan para realizar juicios en su área."
    },
    {
        "concept": "Fitness",
        "definition": "Es un tipo de función que evalúa la calidad de una solución candidata en relación con los objetivos específicos de un problema."
    },
    {
        "concept": "Fotopletismografía",
        "definition": "Técnica que utiliza la detección de cambios en la absorción de luz para medir la variación del volumen sanguíneo en un área específica del cuerpo, generalmente en la piel. Se utiliza en aplicaciones médicas y de monitoreo, como la medición de la frecuencia cardíaca y la saturación de oxígeno en sangre"
    },
    {
        "concept": "Gen",
        "definition": "En el ámbito de los algoritmos evolutivos, se define como la unidad de información más pequeña dentro de un cromosoma. Esta unidad es sobre la que algunos operadores genéticos actúan; de modo que modifican el valor de dicha unidad o cortan un cromosoma justo por donde empieza o terminan."
    },
    {
        "concept": "Heurística",
        "definition": "Conocimiento informal y juicioso de un área de aplicación que constituye las reglas del buen juicio en ese campo. También abarca el conocimiento de cómo resolver problemas de manera eficiente y eficaz, cómo planificar pasos para resolver un problema complejo, cómo mejorar el rendimiento, etc."
    },
    {
        "concept": "Hits",
        "definition": "Cantidad de documentos o resultados relevantes devueltos por un motor de búsqueda o un sistema de recuperación de información en respuesta a una consulta o búsqueda específica."
    },
    {
        "concept": "HUB",
        "definition": "Son consideradas así aquellas páginas web que enlazan a webs de la misma temática a su vez autoridades en esa particular temática."
    },
    {
        "concept": "IDF",
        "definition": "Métrica utilizada en procesamiento de lenguaje natural y recuperación de información que mide la importancia de una palabra en un conjunto de documentos. Cuanto menos frecuente sea una palabra en los documentos, mayor será su valor, lo que la hace más relevante en la identificación de términos clave"
    },
    {
        "concept": "Incertidumbre",
        "definition": "En los sistemas expertos, se trata de un valor que no se puede calcular con una consulta. Muchos sistemas expertos pueden adaptarse a este valor, permiten al usuario indicar si no sabe la respuesta."
    },
    {
        "concept": "Industria 4.0",
        "definition": "Término que se refiere a la integración de las nuevas tecnologías (IA, IoT, análisis de datos, etc.) y la digitalización en los procesos de fabricación y producción para conseguir una mayor flexibilidad e individualización en los procesos productivos."
    },
    {
        "concept": "Inferencia",
        "definition": "Proceso de deducción a partir del encadenamiento (hacia delante o hacia atrás) de reglas basadas en la información disponible con objetivo de generar conclusiones."
    },
    {
        "concept": "Juicio",
        "definition": "Capacidad de un sistema o algoritmo de tomar decisiones basadas en datos y reglas predefinidas."
    },
    {
        "concept": "KDD",
        "definition": "Proceso no trivial que identifica patrones válidos, previamente desconocidos, potencialmente útiles y fundamentalmente entendibels en los datos. Se define también como un proceso de descubrimiento de conocimiento de bases de datos."
    },
    {
        "concept": "LIDAR",
        "definition": "Sistema de detección remota que utiliza pulsos de luz láser para medir distancias y crear mapas tridimensionales de alta resolución de objetos y entornos, comúnmente utilizado en aplicaciones de percepción en vehículos autónomos y topografía."
    },
    {
        "concept": "LSTM",
        "definition": "Un tipo de red neuronal recurrente (RNN) que se utiliza en inteligencia artificial para modelar secuencias de datos y retener información a largo plazo, lo que lo hace especialmente útil en tareas de procesamiento de lenguaje natural y predicción de series temporales."
    },
    {
        "concept": "Metadatos",
        "definition": "Datos sobre datos. En un alamcén de datos, los metadatos describen el contenido de un almacén de datos y su manera de uso"
    },
    {
        "concept": "Mutación",
        "definition": "Operador que realiza pequeñas modificaciones en el cromosoma. Esto permite prevenir la saturación de la población con cromosomas similares, pudiendo obtener soluciones inalcanzables que con el operador de sobrecruzamiento."
    },
    {
        "concept": "Neuronas",
        "definition": "Unidades de proceso de una o varias entradas en una o varias salidas."
    },
    {
        "concept": "Nodo",
        "definition": "En un esquema o representación gráfica en forma de árbol, cada uno de los puntos de origen de las distintas ramificaciones. En el caso del Web Mining de Estructura, cada uno de estos elementos del grafo de web es una página web"
    },
    {
        "concept": "Normalizar",
        "definition": "Técnica que se aplica a un conjunto de datos para reducir su redundancia."
    },
    {
        "concept": "Ontología",
        "definition": "Representación formal y estructurada de los conceptos y sus relaciones en un dominio específico, utilizada para facilitar la comprensión y el razonamiento de las máquinas sobre ese dominio."  
    },
    {
        "concept": "Opacidad",
        "definition": "Falta de transparencia o comprensión clara sobre cómo funcionan los algoritmos y procesos de la IA en la toma de decisiones."
    },
    {
        "concept": "Optimización",
        "definition": "Mejora o perfeccionamiento de un sistema o proceso con el objetivo de maximizar eficiencia, rendimiento o resultados deseados."
    },
    {
        "concept": "Overfitting",
        "definition": "Ocurre cuando un modelo de machine learning es demasiado complejo y se ajusta demasiado a los datos de entrenamiento, periendo su capacidad de generalizar a nuevos datos. ESto puede resultar en un mal rendimiento en datos que no formaron parte del entrenamiento."
    },
    {
        "concept": "PageRank",
        "definition": "Es una familia de algoritmos utilizados para asignar de forma numérica la relevancia de los documentos o páginas web, indexados por un motor de búsqueda en función de la importancia o relevancia de una determinada página web."
    },
    {
        "concept": "Patrón",
        "definition": "Relación matemática, numérica y/o simbólica entre los elementos de los datos."
    },
    {
        "concept": "Pesos",
        "definition": "Valores numéricos asociados a una capa de una Red de Neuronas. Se emplean para determinar los valores de salida de las neuronas y por ende, el comportamiento de la red. Este conjunto de valores es ajustado durante el entrenamiento de la RNA."   
    },
    {
        "concept": "PLN",
        "definition": "Una sub-rama de la inteligencia artificial utilizada en computación lingüística. Su función es extraer información significativa de textos de lenguaje humano para que pueda posteriormente analizarse, por lo que son una herramienta muy útil en el contexto de Text Mining."
    },
    {
        "concept": "POS tagging",
        "definition": "También conocido como etiquetado gramatical, es el proceso de asignar o etiquetar a cada una de las palabras de un texto su categoría gramatical (sustantivo, verbo, adjetivo, etc.)."
    },
    {
        "concept": "Reglas de Producción",
        "definition": "Declaraciones lógicas que describen el conocimiento y las pautas que el sistema experto utiliza para llegar a conclusiones o recomendaciones. Son secuencias del tipo SI (condición) ENTONCES (acción)."
    },
    {
        "concept": "ROC",
        "definition": "Curva de característica operativa del receptor. Representa la sensibilidad frente a la especificidad de un test diagnóstico o clasificador binario. El análisis de este tipo de curva constituye un método estadístico para determinar la exactitud diagnóstica de las pruebas, siendo utilizadas con tres propósitos específicos: determinar el punto de corte de una escala continua en el que se alcanza la sensibilidad y especificidad más alta, evaluar la capacidad discriminativa del test diagnóstico, es decir, su capacidad de diferenciar sujetos sanos versus enfermos."

    },
    {
        "concept": "SEMMA",
        "definition": "Acrónimo de 'Sample, Explore, Modify, Model and Assess', el cual se refiere a un proceso alternativo para proyectos de minería de datos propuesto por el instituto SAS, para desarrollar modelos predictivos y descriptivos."
    },
    {
        "concept": "Shell",
        "definition": "Componente de un sistema experto el cual contiene todos los elementos esenciales de dicho sistema, exceptuando el conocimiento específico del dominio."
    },
    {
        "concept": "Sinapsis",
        "definition": "Proceso de conexión entre neuronas que permite la transmisión de información entre ellas. En las redes de neuronas artificales, representan el aprendizaje de dicha red mediante la asignación de pesos."
    },
    {
        "concept": "Sobrecruzamiento",
        "definition": "Operador de los algoritmos evolutivos que combina el material genético de dos individuos (padres) para generar nuevos individuos (hijos). A este operador también se le suele llamar recombinación."
    },
    {
        "concept": "Sobremuestreo",
        "definition": "Técnica que consiste en agregar más ejemplos de la clase minoritaria en un conjunto de datos desequilibrado para equilibrar las clases y mejorar el rendimiento de los modelos de aprendizaje automático en la detección de patrones y toma de decisiones."
    },
    {
        "concept": "Stemming",
        "definition": "Proceso de reducir una palabra a su raíz. Este proceso es utilizado en text mining. En español, equivale al concepto de derivación."
    },
    {
        "concept": "Stop Words",
        "definition": "Palabras que ya están previamente filtradas tanto antes como después del proceso de datos del lenguaje natural. No hay una lista universal de ellas, pero la mayoría están relacionadas con artículos, verbos auxiliares o palabras específicas del contexto que no tienen un valor útil."
    },
    {
        "concept": "Término",
        "definition": "Palabra o conjunto de palabras extraido directamente de un corpus por medios de procesado de lenguaje natural."
    },
    {
        "concept": "TF-IDF",
        "definition": "Una de las técnicas más comunes para medir cómo de relevante es un término en un documento de una colección. Se trata del producto entre dos métricas, la frecuencia con la que una palabra aparece en un determinado documento; y el inverso de lo común que es una palabra en toda la colección de documentos. Por lo tanto, las palabras que son frecuentes en un documento pero raras en toda la colección obtienen una alta puntuación, lo que sugiere que son términos importantes para ese documento en particular."
    },
    {
        "concept": "Token",
        "definition": "Bloque de texto categorizado en una sentencia, donde esta categoría está relacionada con la función que dicho bloque de texto representa."
    },
    {
        "concept": "Tokenizing",
        "definition": "Proceso de descomponer secuencias de texto, sean oraciones o documentos enteros, en unidades más pequeñas llamadas token (unidades únicas y significativas de texto, como pueden ser palabras)."
    },
    {
        "concept": "Validación Cruzada",
        "definition": "Tecnica utilizada en el aprendizaje automático y la estadística para evaluar el rendimiento de un modelo. Implica dividir los datos en un conjunto de entrenamiento, que se utiliza para entrenar el modelo, y un conjunto de pruebas, que se utiliza para evaluar su rendimiento. La validación cruzada k-fold es una de las variantes más comunes, implica dividir los datos en k subconjuntos. En ella el modelo se entrena y evalúa k veces, utilizando cada subconjunto como conjunto de pruebas en una iteración y los demás subconjuntos como conjunto de entrenamiento. Los resultados se promedian para obtener una medida general del rendimiento del modelo."
    },
    {
        "concept": "Valor umbral",
        "definition": "Cantidad más reducida de una señal que tiene que existir para que sea advertida por un sistema."
    },
    {
        "concept": "Web Crawler",
        "definition": "Mecanismo del navegador que se desplaza por Internet a través de los hipervínculos que aparecen en los sitios web existentes con el fin de evaluar palabras clave, hashtags; indexar el contenido y los URL de cada sitio web; copiar páginas web y abrir todos o solo algunos de los URL que encuentran para analizar nuevos sitios web."
    },
    {
        "concept": "Web Mining",
        "definition": "Proceso de descubrir relaciones intrínsecas de los datos web, los cuáles son expresados en forma de texto, enlaces o uso de la información."
    },
    {
        "concept": "Web Mining de Contenido",
        "definition": "Proceso de extracción de información útil del contenido de páginas web, tanto texto, imágenes, vídeo, audio, listas o tablas. En este campo podemos encontrar técnicas como son la Recuperación de Información (IR) o el Procesado de Lenguaje Natural (NLP)."
    },
    {
        "concept": "Web Mining de Estructura",
        "definition": "Estudio de las relaciones entre páginas web a través de los enlaces. Se dedica a analizar cómo está interconectada la red de páginas web de tal manera que estas se entienden como nodos y a su vez los enlaces se entienden como nexos de un nodo a otro, como si de un grafo se tratara. Gracias a esta estructura de grafo, pueden aplicarse algoritmos como Dijkstra para hallar el camino más rápido de una web a otra."
    },
    {
        "concept": "Web Mining de Utilización",
        "definition": "Estudio de técnicas que pueden predecir el comportamiento del usuario cuando éste interacciona con la web."
    },
    {
        "concept": "World Wide Web",
        "definition": "Gigantesco repositorio de datos donde hay información sobre cualquier tema. Podría considerarse como el repositorio de datos y texto más grande del mundo y además crece en grandes dimensiones cada día."
    }
]
